mathiscastel29560-arch/Esp32/src/menu.cpp
#include "menu.h"
#include "menu_icons.h"
#include "buttons.h"
#include "config.h"
#include "settings.h"
#include "hardware_test_mode.h"
#include "tx_arm.h"
#include "wifi_tools.h"
#include "ble_tools.h"
#include "nrf24_tools.h"
#include "subghz.h"
#include "beacon_spam.h"
#include "evil_portal.h"
#include "ir_tools.h"
#include "ir_bruteforce.h"
#include "ble_spam_detector.h"
#include "rtc_clock.h"
#include "gps_module.h"
#include "battery.h"
#include "help_content.h"
#include "drone_tracker.h"
#include "signal_sniffer.h"
#include "subghz_bruteforce.h"
#include "subghz_replay.h"
#include "subghz_scanner.h"
#include "gps_wardriving.h"
#include "nrf24_replay.h"
#include "wifi_hidden_revealer.h"
#include "iot_device_hunter.h"
#include "ble_spoof.h"
#include "frequency_analyzer.h"
#include "ble_pairing_attack.h"
#include "nrf24_injection.h"
#include "smart_lock_scanner.h"
#include "subghz_protocol_analyzer.h"
#include "ble_dos.h"
#include "ble_beacon_spam.h"
#include "wifi_deauth.h"
#include "ble_advertising_jammer.h"
#include "gps_spoof.h"
#include "advanced_rf_jammer.h"
#include "wifi_jammer_suite.h"
#include "bluetooth_aggressive_jammer.h"
#include "subghz_jammer_suite.h"
#include "ble_advanced_attack_suite.h"
#include "jamming_signal_generator.h"
#include "wpa2_handshake_cracker.h"
#include "wifi_association_hijacker.h"
#include "http_downgrade_attack.h"
#include "rf_signal_recorder.h"
#include "handshake_capture.h"
#include "signal_decoder.h"
#include "advanced_signal_cloner.h"
#include "zigbee_scanner.h"
#include "mqtt_hijacker.h"
#include "zwave_scanner.h"
#include "bluetooth_classic.h"
#include "coap_scanner.h"
#include "lorawan_recon.h"
#include "rfid_emulator.h"
#include "mifare_classic.h"
#include "nfc_cloner.h"
#include "smarthome_hijacker.h"
#include "spectrum_analyzer_plus.h"
#include "modulation_classifier.h"
#include "auto_handshake_capture.h"
#include "generic_packet_tools.h"
#include "advanced_wifi_attacks.h"
#include "ui/scan_visualizations.h"
#include "ui/advanced_scanning.h"
#include "mavic_jammer.h"
#include "tpms_spoofer.h"
#include <vector>
#include <set>

namespace {

enum State {
    HOME,
    MAIN_MENU,
    WIFI_SUBMENU,
    BLE_SUBMENU,
    RF_SUBMENU,
    IOT_SUBMENU,
    SYSTEM_SUBMENU,
    SETTINGS_SUBMENU,
    HARDWARE_TEST_SUBMENU,
    DEVICE_INFO_SUBMENU,
    DEBUG_INFO_SUBMENU,
    CALIBRATION_SUBMENU,
    ABOUT_SUBMENU,
    NETWORK_SUBMENU,
    HELP_SUBMENU,
    RESULT_SCREEN,
    HARDWARE_TEST_SELECT,
};

State g_state = HOME;
int g_selection = 0;
String g_resultTitle, g_resultBody;
uint32_t g_resultShowTime = 0;

// Debounced button tracking
bool g_backHeld = false;
uint32_t g_backHeldSince = 0;

bool consumeBackTap() {
    bool now = TxArm::isArmed();
    bool tapped = false;
    if (now && !g_backHeld) {
        g_backHeldSince = millis();
    } else if (!now && g_backHeld) {
        if (millis() - g_backHeldSince < 500) tapped = true;
    }
    g_backHeld = now;
    return tapped;
}

std::vector<String> mainMenuItems() {
    return {
        "📡 WiFi Tools",
        "🔵 BLE Tools",
        "📶 RF/2.4GHz",
        "🌐 IoT/Advanced",
        "⚙️  System",
        "⚙️  Settings",
        "🧪 Hardware Test",
        "ℹ️  Device Info",
        "🐛 Debug Info",
        "🔧 Calibration",
        "ℹ️  About",
        "🌐 Network",
        "❓ Help",
    };
}

std::vector<String> wifiMenuItems() {
    return {
        "📡 Scan Networks",
        "📡 Reveal Hidden Networks",
        "📡 IoT Device Hunter",
        "📡 Smart Lock Scanner",
        "📡 Frequency Analyzer",
        "📡 Beacon Spam " + String(BeaconSpam::active() ? "STOP" : "start"),
        "📡 Evil Portal " + String(EvilPortal::active() ? "STOP" : "start"),
        "📡 WiFi Deauth " + String(WiFiDeauth::isActive() ? "STOP" : "start"),
        "📡 WiFi Jammer Suite " + String(WiFiJammerSuite::isActive() ? "STOP" : "start"),
        "📡 Association Hijacker",
        "📡 HTTP Downgrade Attack",
        "📡 WPA2 Handshake Cracker",
        "📡 Capture Handshake (WPA2)",
        "🔙 Back",
    };
}

std::vector<String> bleMenuItems() {
    return {
        "🔵 Scan Devices (5s)",
        "🔵 BLE Address Spoof",
        "🔵 BLE Pairing Attack",
        "🔵 BLE DoS Attack",
        "🔵 BLE Beacon Spam " + String(BLEBeaconSpam::isActive() ? "STOP" : "start"),
        "🔵 BLE Advertising Jam " + String(BLEAdvertisingJammer::isActive() ? "STOP" : "start"),
        "🔵 Bluetooth Aggressive Jam " + String(BluetoothAggressiveJammer::isActive() ? "STOP" : "start"),
        "🔵 BLE Advanced Attacks " + String(BLEAdvancedAttackSuite::isActive() ? "STOP" : "start"),
        "🔵 BLE Spam Watch " + String(BleSpamDetector::active() ? "STOP" : "start"),
        "🔵 Check Spam Alert",
        "🔙 Back",
    };
}

std::vector<String> rfMenuItems() {
    return {
        "📶 2.4GHz Spectrum Scan",
        "📶 Drone Tracker (RSSI)",
        "📶 Signal Sniffer (NRF24)",
        "📶 NRF24 Replay Attack",
        "📶 Sub-GHz Scanner",
        "📶 Sub-GHz Bruteforce",
        "📶 Sub-GHz Replay",
        "🔴 IR: TV Power Toggle",
        "🔴 IR: Bruteforce TV",
        "🔴 IR: Bruteforce AC",
        "🔴 IR: Bruteforce Light",
        "🛰️  GPS Spoofing (2.4GHz)",
        "📶 Advanced RF Jammer " + String(AdvancedRFJammer::isActive() ? "STOP" : "start"),
        "📶 Sub-GHz Jammer Suite " + String(SubghzJammerSuite::isActive() ? "STOP" : "start"),
        "📶 Jamming Signal Gen " + String(JammingSignalGenerator::isActive() ? "STOP" : "start"),
        "📶 RF Signal Recorder",
        "📶 Signal Decoder",
        "📶 Advanced Signal Cloner",
        "🚁 Mavic Jammer (2.4GHz)",
        "🔴 TPMS Spoofer (433MHz)",
        "🔙 Back",
    };
}

std::vector<String> settingsMenuItems() {
    return {
        "⏰ Set Date/Time",
        "💡 Brightness: " + String(Settings::g_config.brightness) + "%",
        "🎨 Contrast: " + String(Settings::g_config.contrast) + "%",
        "🔄 Invert Display: " + String(Settings::g_config.invertColors ? "ON" : "OFF"),
        "🔐 Auto-Lock: " + String(Settings::g_config.autoLock ? "ON" : "OFF"),
        "📝 Logging: " + String(Settings::g_config.enableLogging ? "ON" : "OFF"),
        "🔙 Back",
    };
}

